In [1]:
import pandas as pd
# Create dictionary of test scores
test_dict = {'Scotty':[63,75,88], 'Joy':[48,98,92], 'Kamala': [87, 86, 85]}
# Create DataFrame
df = pd.DataFrame(test_dict)
# Transpose DataFrame
df = df.T
# Rename Columns
df.columns = ['Quiz_1', 'Quiz_2', 'Quiz_3']
# Add Quiz 4
df['Quiz_4'] = [92, 95, 88]
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Scotty      63      75      88      92
Joy         48      98      92      95
Kamala      87      86      85      88

In [2]:
import numpy as np
df.loc['Adrian']=[np.NaN, np.NaN, np.NaN, 71]
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4
Scotty    63.0    75.0    88.0    92.0
Joy       48.0    98.0    92.0    95.0
Kamala    87.0    86.0    85.0    88.0
Adrian     NaN     NaN     NaN    71.0

In [3]:
df['Quiz_Avg'] = df.mean(axis=1, skipna=True)
df

        Quiz_1  Quiz_2  Quiz_3  Quiz_4  Quiz_Avg
Scotty    63.0    75.0    88.0    92.0     79.50
Joy       48.0    98.0    92.0    95.0     83.25
Kamala    87.0    86.0    85.0    88.0     86.50
Adrian     NaN     NaN     NaN    71.0     71.00

In [4]:
df.Quiz_4.astype(int)

Scotty    92
Joy       95
Kamala    88
Adrian    71
Name: Quiz_4, dtype: int64

In [5]:
df['Quiz_4']=df.Quiz_4.astype(int)